import sys, re
def せいすう(): return int(input())
def たくさんのせいすう(): return map(int, input().split())
def せいすうのリスト(): return list(map(int, input().split()))

ようそすう = せいすう()
いま = せいすうのリスト()
もくひょう = せいすうのリスト()

def こうじゅんにならびかえ(リスト):
	return sorted(リスト, reverse=True)

def しゅつりょく(しゅつりょくしたいもじ):
	print(しゅつりょくしたいもじ)

def ごうけい(リスト):
	return sum(リスト)

def ながさ(リスト):
	return len(リスト)

def まとめる(リスト1, リスト2):
	return zip(リスト1, リスト2)

def おわり():
	exit()

def いちをたす(すうじ):
	return すうじ+1

def リストについか(リスト, あたい):
	リスト.append(あたい)

if ごうけい(いま) < ごうけい(もくひょう):
	しゅつりょく(-1)
	おわり()

ふそくリスト = []
よゆうリスト = []

for いまのじゅんびど, もくひょうのじゅんびど in まとめる(いま, もくひょう):
	if いまのじゅんびど < もくひょうのじゅんびど:
		リストについか(ふそくリスト, もくひょうのじゅんびど-いまのじゅんびど)
	else:
		リストについか(よゆうリスト, いまのじゅんびど-もくひょうのじゅんびど)

ふそくこすう = ながさ(ふそくリスト)
if ふそくこすう == 0:
	しゅつりょく(0)
	おわり()

ふそくぶん = ごうけい(ふそくリスト)
よゆうソート = こうじゅんにならびかえ(よゆうリスト)

こたえ = ふそくこすう
おぎなうぶん = 0
for よゆうぶん in よゆうソート:  # これはにぶたんでもできます
	おぎなうぶん += よゆうぶん
	こたえ = いちをたす(こたえ)
	if おぎなうぶん >= ふそくぶん:
		break

しゅつりょく(こたえ)
